# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

In [2]:
url='https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv'

### Step 3. Assign it to a variable called baby_names.

In [3]:
baby_names=pd.read_csv(url)

In [4]:
baby_names

         Unnamed: 0       Id     Name  Year Gender State  Count
0             11349    11350     Emma  2004      F    AK     62
1             11350    11351  Madison  2004      F    AK     48
2             11351    11352   Hannah  2004      F    AK     46
3             11352    11353    Grace  2004      F    AK     44
4             11353    11354    Emily  2004      F    AK     41
...             ...      ...      ...   ...    ...   ...    ...
1016390     5647421  5647422     Seth  2014      M    WY      5
1016391     5647422  5647423  Spencer  2014      M    WY      5
1016392     5647423  5647424     Tyce  2014      M    WY      5
1016393     5647424  5647425   Victor  2014      M    WY      5
1016394     5647425  5647426   Waylon  2014      M    WY      5

[1016395 rows x 7 columns]

### Step 4. See the first 10 entries

In [5]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [6]:
baby_names=baby_names.drop(['Unnamed: 0','Id'],axis=1)

In [7]:
baby_names

            Name  Year Gender State  Count
0           Emma  2004      F    AK     62
1        Madison  2004      F    AK     48
2         Hannah  2004      F    AK     46
3          Grace  2004      F    AK     44
4          Emily  2004      F    AK     41
...          ...   ...    ...   ...    ...
1016390     Seth  2014      M    WY      5
1016391  Spencer  2014      M    WY      5
1016392     Tyce  2014      M    WY      5
1016393   Victor  2014      M    WY      5
1016394   Waylon  2014      M    WY      5

[1016395 rows x 5 columns]

### Step 6. Is there more male or female names in the dataset?

In [8]:
baby_names['Gender'].value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

In [9]:
print (f'The most babies is: {baby_names.Gender.value_counts().index[0]} with number of: {baby_names.Gender.value_counts()[0]} baby')

The most babies is: F with number of: 558846 baby

### Step 7. Group the dataset by name and assign to names

In [10]:
baby_names.drop('Year',axis=1)

            Name Gender State  Count
0           Emma      F    AK     62
1        Madison      F    AK     48
2         Hannah      F    AK     46
3          Grace      F    AK     44
4          Emily      F    AK     41
...          ...    ...   ...    ...
1016390     Seth      M    WY      5
1016391  Spencer      M    WY      5
1016392     Tyce      M    WY      5
1016393   Victor      M    WY      5
1016394   Waylon      M    WY      5

[1016395 rows x 4 columns]

In [11]:
names=baby_names.drop('Year',axis=1).groupby('Name').sum()
names

         Count
Name
Aaban       12
Aadan       23
Aadarsh      5
Aaden     3426
Aadhav       6
...        ...
Zyra        42
Zyrah       11
Zyren        6
Zyria       59
Zyriah      58

[17632 rows x 1 columns]

### Step 8. How many different names exist in the dataset?

In [12]:
len (names)

17632

In [13]:
baby_names.Name.value_counts().count()

17632

### Step 9. What is the name with most occurrences?

In [14]:
names

         Count
Name
Aaban       12
Aadan       23
Aadarsh      5
Aaden     3426
Aadhav       6
...        ...
Zyra        42
Zyrah       11
Zyren        6
Zyria       59
Zyriah      58

[17632 rows x 1 columns]

In [15]:
# Solution 1
names.Count.sort_values(ascending=False).head(1)

Name
Jacob    242874
Name: Count, dtype: int64

In [16]:
# Another way
names.Count.sort_values(ascending=False).index[0]

'Jacob'

In [17]:
# Solution 2
names.Count.idxmax()

'Jacob'

### Step 10. How many different names have the least occurrences?

In [18]:
len(names['Count'][names.Count == names.Count.min()])

2578

In [19]:
print (f"The number of least occurence names is: {len (names['Count'][names.Count == names.Count.min()])} with occurrence = {names.Count.min()} times for each name")

The number of least occurence names is: 2578 with occurrence = 5 times for each name

### Step 11. What is the median name occurrence?

In [20]:
names.Count.median()

49.0

In [21]:
names[names.Count==names.Count.median()]

         Count
Name
Aishani     49
Alara       49
Alysse      49
Ameir       49
Anely       49
...        ...
Sriram      49
Trinton     49
Vita        49
Yoni        49
Zuleima     49

[66 rows x 1 columns]

### Step 12. What is the standard deviation of names?

In [22]:
names['Count'].std()

11006.069467891111

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [23]:
names[['Count']].describe()

               Count
count   17632.000000
mean     2008.932169
std     11006.069468
min         5.000000
25%        11.000000
50%        49.000000
75%       337.000000
max    242874.000000